[
  {
    "title": "Anuvaad Client SDK",
    "desc": "Developed a Software Development Kit (SDK) to enable seamless translation across 22+ Indian languages, leveraging the Bhashini API for robust and scalable multilingual support. Selected as the sole developer for the project and successfully delivered it two weeks ahead of the 8-week timeline. Utilized JavaScript for core development, Postman for API testing, and jsDoc for detailed technical documentation and developer usability. The SDK aimed to enhance accessibility for Indian language applications and streamline integration for client platforms.",
    "technologyUsed": [],
    "topics": ["Javascript", "SDK", "API", "JsDoc", "Open Source"],
    "tags":["opensource internship"],
    "github": "anuvaad-client-sdk", 
    "access":"granted",
    "deployed": null,
    "image": ["https://ik.imagekit.io/playitnav/highlights/anpr.png?updatedAt=1753538478172"],
    "videos": ["https://www.youtube.com/embed/xJZ6As4f5_M?rel=0&modestbranding=1"],
    "category":["other"],
    "completionDate": "2023-09"
  },
  {
    "title": "ANPR under Occlusion & Poor-Visibility",
    "desc": "Developed a real-time number plate recognition system for closed campus areas such as malls, colleges, and residential societies, addressing challenges like partial occlusion and low-light conditions. Utilized YOLOv11n for accurate detection of number plates even when partially blocked, and integrated EasyOCR for robust character recognition from unclear or incomplete text. Implemented a smart matching mechanism to reconstruct full plate numbers from multiple partial detections. The system significantly enhances recognition accuracy and reliability, making it suitable for secure, real-time applications.",
    "technologyUsed": [],
    "topics": ["Computer Vision", "YOLOv5", "Python", "FastAPI", "OpenCV", "AI"],
    "github": "anpr-occlusion-poor-visibility",
    "access":"granted",
    "deployed": null,
    "image": ["https://ik.imagekit.io/playitnav/highlights/anpr.png?updatedAt=1753538478172"],
    "videos": ["https://www.youtube.com/embed/xJZ6As4f5_M?rel=0&modestbranding=1"], 
    "category":["websites","AI/ML"],
    "completionDate": "2025-06"
  },
  {
    "title": "Women Safety SOS",
    "desc": "Designed and developed a cross-platform mobile app using React Native to provide quick emergency assistance for women. Features include live location tracking, one-tap SOS alerts, and emergency contact notifications via SMS and WhatsApp.",
    "technologyUsed": [],
    "topics": ["React Native", "Mobile App", "Firebase", "Geolocation", "Android"],
    "github": "women-safety-SOS-",
    "access":"denied",
    "deployed": "https://expo.dev/@yourusername/women-safety",
    "image": ["https://ik.imagekit.io/playitnav/highlights/anpr.png?updatedAt=1753538478172"],
    "videos": ["https://www.youtube.com/embed/xJZ6As4f5_M?rel=0&modestbranding=1"],
    "category":["mobile"],
    "completionDate": "2024-03-12"
  },
  {
    "title": "Hospital Acquired Infections - ML Research",
    "desc": "Hospital-acquired infections (HAIs) impact millions globally, with common types including bloodstream infections, pneumonia, urinary tract infections, and surgical site infections. This research focused on developing a machine learning model to accurately predict HAI risk using patient and hospital data. Leveraging algorithms such as Random Forest, Support Vector Machine (SVM), and Gaussian Naive Bayes (NB), the model identifies key risk factors and generates personalized risk scores to support early intervention and targeted prevention strategies. Advanced optimization techniques like GridSearchCV were employed, achieving a cross-validation accuracy of 96.44%. The system was deployed using FastAPI for seamless API integration. Contributed to both the model development and deployment, and co-authored a research paper published in the book Prospects of Science, Technology and Applications..",
    "technologyUsed": [],
    "topics": ["ML", "Research", "Healthcare", "Data Science", "Python", "Scikit-Learn"],
    "github": "Symposium-source-code",
    "access":"granted",
    "deployed": null,
    "image": "https://ik.imagekit.io/playitnav/highlights/hai.png?updatedAt=1753538926851",
    "videos": ["https://www.youtube.com/embed/xJZ6As4f5_M?rel=0&modestbranding=1"],
    "category":["websites","AI/ML"],
    "completionDate": "2024-06"
  }
]
