{
    "name": "Naveen Kumar",
    "email": "navstr10@gmail.com",
    "github": "https://github.com/naveen1m",
    "linkedin": "https://linkedin.com/in/navstr10",
    "twitter": "https://twitter.com/naveen10",
    "instagram": "https://instagram.com/navstr10",
    "bio": "I’m a B.Tech graduate in Computer Science & IT with a passion for building intelligent, scalable, and user-focused digital products. What began as a curiosity for how systems work soon evolved into a deep-rooted drive to build purposeful technology. Over the years, I’ve built 50+ personal projects, delivered freelance solutions for real clients, and gained practical experience through internships — turning ideas into fully functional, real-world applications. With 60+ projects under my belt — spanning personal builds, hackathons, internships, and freelance work — I’ve created full-stack web applications, Android apps, and AI-powered systems using machine learning and deep learning, reflecting both depth and versatility. Along the way, I’ve published research, built real-world projects, and continuously explored the deeper layers of software development and machine learning. I remain driven by a single goal: to create technology that not only works, but learns, scales, and leaves a lasting impact.",
     "tags": ["web application developer", "AI/ML developer"],
    "about": "I’m a B.Tech graduate in Computer Science with a passion for building intelligent, scalable, and user-focused digital products. I’ve built over 60+ projects—ranging from full-stack web apps and Android applications to AI/ML systems—spanning personal projects, internships, freelance work, and hackathons. Along the way, I’ve published research on Hospital Acquired Infections and continuously explored the deeper layers of software engineering, machine learning, and AI. <br/> I remain driven by a single goal: to create technology that works flawlessly, scales effortlessly, and makes a lasting impact.",
    "image": "https://yourcdn.com/images/profile.jpg",
    "resume": "https://google-drive/resume.com"
  }
  